package ex06_List;

public class CafeApp {
//	카페 주문 프로그램
//	1. 메뉴보기
//	2. 주문하기
//	3. 결제하기
//	4. 프로그램 종료
//
//	MenuItem클래스에 메뉴이름과 가격을 갖는다.
//	CafeApp(Main)클래스에서 메뉴를 담는 ArrayList
//	장바구니 ArrayList를 만들고 다음과 같이 작동하도록 만드세요
//
//	=== 카페 주문 시스템 ===
//	1. 메뉴 보기
//	2. 주문 추가
//	3. 결제하기
//	4. 종료
//	번호 선택: 1
//
//	[ 메뉴판 ]
//	1. 아메리카노 - 3000원
//	2. 라떼 - 3500원
//	3. 카푸치노 - 4000원
//
//	=== 카페 주문 시스템 ===
//	1. 메뉴 보기
//	2. 주문 추가
//	3. 결제하기
//	4. 종료
//	번호 선택: 2
//	메뉴 번호 입력: 1
//	'아메리카노'가 주문에 추가되었습니다.
//
//	=== 카페 주문 시스템 ===
//	1. 메뉴 보기
//	2. 주문 추가
//	3. 결제하기
//	4. 종료
//	번호 선택: 2
//	메뉴 번호 입력: 2
//	'라떼'가 주문에 추가되었습니다.
//
//	=== 카페 주문 시스템 ===
//	1. 메뉴 보기
//	2. 주문 추가
//	3. 결제하기
//	4. 종료...
	
	
//	[ 현재 주문 내역 ]
//	1. 아메리카노 - 3000원
//	2. 라떼 - 3500원
//	취소할 주문 번호를 입력하세요: 2
//	'라떼' 주문이 취소되었습니다.
	public static void main(String[] args) {
		
	}
}
